[
  "August 2 - Indiana Jones and the Fate of Atlantis Expired September 2 - Sam & Max: Hit the Road As reported - LucasArts was one of the defining developers in the adventure and …",
  "Looks like the hats are black or white and come in medium or large. I'm assuming this is a pricing error? Free shipping if you're a OneASICS Member which has a free sign up. You also get …",
  "This is a little bit of a hack but it's similar to Adobe and eBay subscriptions. I had too many Office 365 licenses so I decided to cancel one and ended up with a message that says Microsoft can …",
  "Was looking around for a new BBQ, and looks like TGG is having a 15% off BBQ sale. Weber Baby Q Titanium LPG - $279 (C&C) here Weber Baby Q Black LPG - $279 (C&C) here ",
  "CPU Intel i7-10700KF 8 Core/16 Threads Processor Cooler Tower Air Cooler with 120mm RGB Fan (brand may vary) Motherboard B560 HD3 LGA 1200 ATX Motherboard Graphic Card RTX3060Ti 8GB Video …",
  "First month free when you sign up by 31/01/2022 and save $5 per month if you have a mobile plan with them. Cancel within the first month and pay no exit fees. Maximum modem cost of $612. Plan with …",
  "With many Australians in lockdown, all Telstra Plus members, regardless of vaccination status, can receive a digital care package that includes a Telstra TV Box Office movie on us, discounts on a …",
  "Great monitor for the price. First time poster hope I did it right ",
  "Fulfilled by Amazon UK. Just got a price-drop notification from 3camels that this kit is at its lowest ever. Hopefully helps someone out there with their lockdown blues, maybe come out of this with a …",
  "The deal also offers 1 month free on duo, family or student plans. Happy Thursday! ",
  "Just received an email from TGG, 50% off on Logitech clearance items. The G920 and G29 are included and both selling for $249 each with code. Logitech G703 Lightspeed Wireless Gaming Mouse …",
  "Come celebrate iHerb’s 25th Anniversary with 25% DISCOUNT EVERY DAY in September, featuring your favorite categories and brands! First up, get 25% OFF on products from the entire iHerb Brands …",
  "A new benefit for Orange Everyday card holders who meet the bonus criteria. Unsure what the list of eligible utilities are, but seems like paying by BPAY or direct debit can get you up to $100 per …",
  "1L Vitasoy Milk Oat $1.45 ($1.31 S&S), Almond $1.50 ($1.35 S&S), Rice $1.50 + Delivery ($0 with Prime/ $39 Spend) @ Amazon AU Amazon are matching the pricing at Coles. ",
  "Subscribe to our newsletter and stay informed about the latest deals, sales and discussions! Email sends out every morning.",
  "Spotted this on the Telstra Plus page, seems like a nice freebie. Might come in handy at some point to be eligible for purchases with minimum point spends. Thank you for making a difference …",
  "30% device discount for: SAMSUNG GALAXY S21 ULTRA 5G 128GB SILVER SAMSUNG GALAXY S21 ULTRA 5G 256GB BLACK Confirmed in chat Mod: All Telstra Day Deal Posts ",
  "Quite a good deal in my opinion, 110k bonus Qantas Points with a $3000 spend in the first 3 months of card membership, as well as $200 back to your account. A $450 Annual fee still applies, however …",
  "A great price on the 4TB Seagate Backup Plus 2.5\" External HDD. ",
  "Contactless delivery within 24hr powered by Doordash. Excludes prescriptions, pharmacist only medication and pharmacy medicine. Participating stores only. What To Do When choosing a delivery …",
  "Great deals on Bellroy. 25% Off (on checkout) on a lot of of products https://www.davidjones.com/brand/bellroy ",
  "This deal is back, although price is only available for Robot White Carbon Black is $89 Pulse Red is $94 ",
  "Did my 15th donation the other day and Thought I’d ask if anyone else in the OzB community give blood and if so, how many donations do far? Mod Note: Visit Australian Red Cross Lifeblood for …",
  "You crafty folks of OzBargain. Long story short, my fiancé borrowed her colleagues car to come home during her work lunch break to take medication for a condition. The car's owner has a …",
  "Comments from Amazon are that this Starts 1 November 2021 on Visa credit. To avoid, use debit, ZIP or non-Visa credit. What does everyone think about this. I use Visa as my main credit card. Is …",
  "Hey everyone, I got my first Prizer shot a couple weeks back, and ever since then, I’ve had like a sensation of blocked ears and a tinnitus like whooshing sound almost continuously. While the …",
  "Next time you’re wondering why your parcel hasn’t arrived on time, have a think about the delivery driver who may have brought your parcel. ‘This is just no way to live’: What it’s like …",
  "Your front page may look different. Click the menu to customise.More Information",
  "All trademarks are owned by their respective owners.OzBargain is an independent community website which has no association with nor endorsement by the respective trademark owners.",
  "Copyright © 2006-2021 OzBargain ABN: 26 144 073 772"
]
